app/views/home/index.html.erb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<script>
jQuery(document).ready(function($) {
  var coinsNames = [];
  var coinsSummary = [];

  $( ".wrap__each__coin" ).each(function() {
      // For Name
       var coinName = $(this).find(".coin__name");
       var coinName = coinName.text();
       coinsNames.push(coinName);
       // For value
       var coinSumm =  $(this).find(".curr__value__coin > span").text() ;
       coinsSummary.push(coinSumm);

    });
    console.log('>>>>' + coinsSummary[0]);
    console.log('>>>>' + coinsSummary[1]);



  var ctx = document.getElementById("myChart").getContext('2d');
  var myChart = new Chart(ctx, {