app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("symbol", "person_id", "cost_per", "amount_owned", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["symbol", "VEN"], ["person_id", 1], ["cost_per", 1.0], ["amount_owned", 1.0], ["created_at", "2018-06-27 02:59:15.288873"], ["updated_at", "2018-06-27 02:59:15.288873"]]

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "cost_per_sold" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["cost_per_sold", 1.0], ["updated_at", "2018-06-27 13:13:34.008343"], ["id", 10]]

    def correct_person
      @correct = current_person.coins.find_by(id: params[:id])
---
SELECT  "coins".* FROM "coins" WHERE "coins"."person_id" = ? AND "coins"."id" = ? LIMIT ?  [["person_id", 2], ["id", 2], ["LIMIT", 1]]