app/controllers/home_controller.rb

SELECT  "coins".* FROM "coins" ORDER BY "coins"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @coins = Coin.all