app/controllers/static_pages_controller.rb

  def history
    @coins = Coin.all
---
SELECT "coins".* FROM "coins"