app/views/coins/index.html.erb

SELECT "coins".* FROM "coins"
---
<script>
jQuery(document).ready(function($) {
  // Chart #1 Start
  var coinsNames = [];
  var coinsSummary = [];

  $( ".wrap__each__coin" ).each(function() {
      // For Name
       var coinName = $(this).find(".coin__name");

       var coinName = coinName.text();
       coinsNames.push(coinName);
       // For value
       var coinSumm =  $(this).find(".curr__value__coin .curientValue").text() ;
       coinsSummary.push(coinSumm);

    });




  var ctx = document.getElementById("myChart").getContext('2d');